views/matches/_form.php

       '3:2' => '3:2',
       ]) ?>

       <?= $form->field($model, 'team1')->dropDownList(ArrayHelper::map(MatchesHome::find()->all(), 'team_home','team_home'),['prompt' => '-----','maxlength' => true, 'placeholder' => 'Пример: Зенит-СПБ']) ?>

       <?= $form->field($model, 'team2')->dropDownList(ArrayHelper::map(MatchesAway::find()->all(), 'team_away','team_away'),['prompt' => '-----','maxlength' => true, 'placeholder' => 'Пример: Локомотив-Новосибирск']) ?>

       <?= $form->field($model, 'tournament')->dropDownList(ArrayHelper::map(\app\models\Matches::find()->all(), 'tournament','tournament'),['placeholder' => 'Пример: Чемпионат России (22/23)']) ?>

       <?= $form->field($model, 'match_status')->dropDownList(ArrayHelper::map(Status::find()->all(), 'status','status'),['prompt' => '-----']) ?>
---
SELECT * FROM `matches_home`
SELECT * FROM `matches_away`
SELECT * FROM `matches`
SELECT * FROM `status`