controllers/ClubController.php

    protected function findModel($id_club)
    {
        if (($model = Club::findOne(['id_club' => $id_club])) !== null) {
---
SELECT * FROM `club` WHERE `id_club`='30'