views/club/_search.php


    <?= $form->field($model, 'name') ?>

    <?= $form->field($model, 'position')->dropDownList(ArrayHelper::map(Club::find()->all(), 'position','position'),['prompt' => '-----',])?>
---
SELECT * FROM `club`